Repository: Histropedia/welsh-biography
Catalog: server/locale/*/LC_MESSAGES/messages.po
Languages: cy

source: Dictionary of Welsh Biography
cy: Y Bywgraffiadur Cymreig

source: Search the Timeline
cy: Chwiliwch y Llinell Amser

source: Welsh History
cy: Hanes Cymry

source: Filters
cy: hidlwyr

source: Colour Code
cy: Côd Lliw

source: Wikipedia
cy: Wicipedia

source: DWB
cy: YBC

source: Filter the Timeline
cy: Hidlo'r Llinell Amser

source: Choose the type of filter you want to apply
cy: Dewis hidlydd

source: Clear All Filters
cy: Clirio'r Holl Hidlwyr

source: back
cy: Nôl

source: Close
cy: Cau

source: Filter by
cy: Hidlo yn ôl

source: Colour Code by
cy: Côd lliw yn ôl

source: No English Wikipedia article available for this person.
cy: Nid oes erthygl Wicipedia Cymraeg am y person yma

source: Learn how to add this missing article to Wikipedia
cy: Dysgwch sut i greu'r erthygl Wicipedia yma
