{
	"Dictionary of Welsh Biography": "Y Bywgraffiadur Cymreig",
	"Search the Timeline": "Chwiliwch y Llinell Amser",
	"Welsh History": "Hanes Cymru",
	"Filters": "Hidlo",
	"Colour Code": "Côd Lliw",
	"Info": "Info",
	"Wikipedia": "Wicipedia",
	"Filter the Timeline": "Hidlo'r Llinell Amser",
	"Choose the type of filter you want to apply": "Dewis hidlydd",
	"Clear All Filters": "Clirio'r Holl Hidlwyr",
	"Filter by": "Hidlo yn ôl",
	"Close": "Cau",
	"Colour Code by": "Côd lliw yn ôl",
	"No English Wikipedia article available for this person.": "Nid oes erthygl Wicipedia Cymraeg am y person yma",
	"Learn how to add this missing article to Wikipedia": "Dysgwch sut i greu'r erthygl Wicipedia yma",
	"The Dictionary of Welsh Biography interactive timeline was developed by <a href=\"http://histropedia.com\">Histropedia</a> for The National Library of Wales, with grant funding from the <a href=\"https://www.end2end.ch/index.php/www-my-d-org\">My-D Foundation</a>.": "Datblygwyd llinell amser ryngweithiol Y Bywgraffiadur Cymreig gan <a href=\"http://histropedia.com\">Histropedia</a> ar gyfer Llyfrgell Genedlaethol Cymru, gyda chyllid grant gan y <a href=\"https://www.end2end.ch/index.php/www-my-d-org\">My-D Foundation</a>.",
	"The timeline is powered using linked open data and openly licenced content hosted by the <a href=\"https://www.wikimedia.org/\">Wikimedia</a> projects.": "Gyrrir y llinell amser gan ddata agored cysylltiedig a chynnwys agored sy’n dod o brosiectau <a href=\"https://www.wikimedia.org/\">Wikimedia</a>.",
	"This allows us to offer our users a new visual and interactive way of exploring the Dictionary of Welsh Biography content.": "Mae hyn yn caniatáu inni gynnig ffordd weledol a rhyngweithiol i'n defnyddwyr i archwilio cynnwys y Bywgraffiadur Cymreig.",
	"Much of the data, and images used has been shared by The National Library of Wales, however the timeline also uses data and images shared by other institutions and individuals.": "Mae llawer o'r data, a'r delweddau a ddefnyddiwyd wedi'u rhannu gan Lyfrgell Genedlaethol Cymru, ond mae'r llinell amser hefyd yn defnyddio data a delweddau a rennir gan sefydliadau ac unigolion eraill.",
	"Whilst every effort is made to ensure the accuracy of this data we cannot guarantee the quality of all data used.": "Er y gwneir pob ymdrech i sicrhau cywirdeb y data hwn ni allwn warantu ansawdd yr holl ddata a ddefnyddir.",
	"The Timeline only includes individuals whose birth or death dates are known or approximated.": "Dim ond unigolion y gwyddom eu dyddiad geni neu farwolaeth a gynhwysir yn y llinell amser.",
	"The timeline does not include entries for people with no known dates and does not include entries for families or groups of people.": "Nid yw'r llinell amser yn cynnwys cofnodion ar gyfer pobl heb ddyddiadau hysbys ac nid yw'n cynnwys cofnodion ar gyfer teuluoedd na grwpiau.",
	"To perform a search of all the Welsh Biography entries please search using the <a href=\"https://biography.wales/\">Dictionary of Welsh Biography website</a>.": "Defnyddiwch <a href=\"https://bywgraffiadur.cymru/\">wefan Y Bywgraffiadur Cymreig</a> er mwyn chwilio holl gofnodion y Bywgraffiadur.",
	"This website is open source.": "Mae'r wefan hon yn ffynhonnell agored.",
	"You can access the code via <a href=\"https://github.com/histropedia/welsh-biography\">Github</a>.": "Cewch fynediad i'r cod trwy <a href=\"https://github.com/histropedia/welsh-biography\">Github</a>."
}